'''2. Напишите программу, которая найдёт произведение пар чисел списка. 
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]'''

a = [2, 3, 4, 5, 6]
mult = 1
count = 0
while count < len(a)/2:
    for i in range(len(a)-1):
        mult = int(a[i])*int(a[-i])
        print(mult)
    count+= 1